Problem 1

The accompanying data set contains three numerical variables, x1, x2, and x3.

In [2]:
# load data (remember to upload the datafile you downloaded from connect to colab)
import pandas as pd
myData = pd.read_excel('Ch2_Q9_V19_Data_File.xlsx')
myData

    Observation    x1     x2     x3
0             1  33.0  371.0  189.0
1             2  28.0  752.0    NaN
2             3  24.0  673.0  204.0
3             4  17.0    NaN  151.0
4             5  20.0   66.0  191.0
..          ...   ...    ...    ...
86           87  18.0  412.0  137.0
87           88  28.0  629.0  139.0
88           89  22.0  167.0  125.0
89           90  35.0  842.0  126.0
90           91  38.0  180.0  151.0

[91 rows x 4 columns]

a. How many observations have x1 values greater than 30?

In [3]:
# you can put .count() at the and of your query
myData.query("x1 > 30").count()

Observation    17
x1             17
x2             17
x3             17
dtype: int64

b. Sort the data by x1, x2, and then x3 all in ascending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

In [4]:
myData.sort_values(x1, ascending = False)

NameError: name 'x1' is not defined

c. Sort the data by x1 and x2 both in descending order. What are the x1, x2, and x3 values of the first observation after the data are sorted?

d. How many missing values are there in x1, x2, and x3?

Problem 2.

The following table lists a portion of the average writing and math SAT scores for the 50 states as well as the District of Columbia, Puerto Rico, and the U.S. Virgin Islands for the year 2017 as reported by the College Board.

In [ ]:
# Load data

a. Sort the data by writing scores in descending order. Which state has the highest average writing score? What is the average math score of that state?

b. Sort the data by math scores in ascending order. Which state has the lowest average math score? What is the average writing score of that state?

c. How many states reported an average math score higher than 600?

In [ ]:
# remember to put .count() at the end

d. How many states reported an average writing score lower than 550?

Problem 3

Consider the information on annual income (Income in $1,000s), age, sex (F = female, M = male), and marital status (Married; Y = yes, N = no). A portion of the data is shown in the accompanying table.

In [ ]:
# Load data

a. Count the number of males and females in the data.

b. What percentage of males and females are married?

In [ ]:
# you can count the numerator and the denominator separately and just divide the two numbers

c. Of the 10 individuals with the highest income, how many are married males?

In [ ]:
# Isolate top 10 income individuals and assign it to a new dataset (e.g.: top10_income = ...)

In [ ]:
# Subset for married and male from isolated dataset and count  ( put .count() at the end of query)

d. What are the highest and the lowest incomes of males and females?

In [ ]:
# YOu can create sorted tables and read off the values

e. What are the highest and lowest incomes of married and unmarried males?